{"_id":{"$oid":"624369aaca5f2c91fe173704"},"Title":"Silence of the Lambs","Description":"updated description.","Genre":{"Name":"Thriller","Description":"Thriller film, also known as suspense film or suspense thriller, is a broad film genre that involves excitement and suspense in the audience."},"Director":{"Name":"Jonathan Demme","Bio":"Robert Jonathan Demme was an American director, producer, and screenwriter.","Birth":"1944","Death":"2017"},"ImagePath":"silenceofthelambs.png","Featured":true}
{"_id":{"$oid":"6244a470d89f692f38186a76"},"Title":"Princess Mononoke","Description":"In the 14th century, the harmony that humans, animals and gods have enjoyed begins to crumble. The protagonist, young Ashitaka - infected by an animal attack, seeks a cure from the deer-like god Shishigami. In his travels, he sees humans ravaging the earth, bringing down the wrath of wolf god Moro and his human companion Princess Mononoke. Hiskattempts to broker peace between her and the humans brings only conflict.","Genre":{"Name":"Anime","Description":"In Japan and in Japanese, anime (a term derived from the English word animation) describes all animated works, regardless of style or origin."},"Director":{"Name":"Hayao Miyazaki","Bio":"Updated","Birth":"1941"},"ImagePath":"www.seekpng.com/png/detail/314-3146070_princess-mononoke.png","Featured":true}
{"_id":{"$oid":"6244aeaca96034e380ce27c5"},"Description":"The aging patriarch of an organized crime dynasty in postwar New York City transfers control of his clandestine empire to his reluctant youngest son.","Genre":{"GenreID":1.0,"Name":"Crime Film","Description":"Crime films, in the broadest sense, is a film genre inspired by and analogous to the crime fiction literary genre."},"Director":{"DirectorID":1.0,"Name":"Francis Ford Coppola","Bio":"Francis Ford Coppola is an American film director, producer, and screenwriter. He was a central figure in the New Hollywood filmmaking movement of the 1960s and 1970s.","Birth":"1939"},"ImagePath":"https://m.media-amazon.com/images/M/MV5BYWNlN2U4YjQtMzI3NC00ZjkxLWEwMTItYWRlNDUxYTYwYjVlXkEyXkFqcGdeQWpvaG5oYXJ0._V1_QL75_UX500_CR0,0,500,281_.jpg","Featured":true}
{"_id":{"$oid":"6244aedba96034e380ce27c6"},"Title":"The Godfather Part II","Description":"The early life and career of Vito Corleone in 1920s New York City is portrayed, while his son, Michael, expands and tightens his grip on the family crime syndicate.","Genre":1.0,"Director":1.0,"ImagePath":"https://m.media-amazon.com/images/M/MV5BMWMwMGQzZTItY2JlNC00OWZiLWIyMDctNDk2ZDQ2YjRjMWQ0XkEyXkFqcGdeQXVyNzkwMjQ5NzM@._V1_.jpg","Featured":true}
{"_id":{"$oid":"6244aefca96034e380ce27c7"},"Title":"The Godfather Part III","Description":"Follows Michael Corleone, now in his 60s, as he seeks to free his family from crime and find a suitable successor to his empire.","Genre":1.0,"Director":1.0,"ImagePath":"https://m.media-amazon.com/images/M/MV5BMTAyNzcyODQ5NzReQTJeQWpwZ15BbWU4MDM2MzQ0OTEy._V1_.jpg","Featured":true}
{"_id":{"$oid":"62461d47a96034e380ce27c8"},"Title":"CODA","Description":"Ruby is the only hearing member of a deaf family from Gloucester, Massachusetts. At 17, she works mornings before school to help her parents and brother keep their fishing business afloat. But in joining her high school's choir club, Ruby finds herself drawn to both her duet partner and her latent passion for singing.","Genre":{"GenreID":2.0,"Name":"Comedy-Drama","Description":"Comedy drama, or dramedy, is a genre of dramatic works that combines elements of comedy and drama."},"Director":{"Name":"Sian Heder","Bio":"Sian Heder is an American writer, producer, and director best known for CODA.","Birth":"1977"},"ImagePath":"https://m.media-amazon.com/images/M/MV5BYzkyNzNiMDItMGU1Yy00NmEyLWE4N2ItMjkzMDZmMmVhNDU4XkEyXkFqcGdeQXVyMTkxNjUyNQ@@._V1_QL75_UX190_CR0,2,190,281_.jpg","Featured":true}
{"_id":{"$oid":"62461e60a96034e380ce27c9"},"Title":"Encanto","Description":"The Madrigals are an extraordinary family who live hidden in the mountains of Colombia in a charmed place called the Encanto. The magic of the Encanto has blessed every child in the family with a unique gift -- every child except Mirabel. However, she soon may be the Madrigals last hope when she discovers that the magic surrounding the Encanto is now in danger.","Genre":{"GenreID":3.0,"Name":"Animation","Description":"Animated film is a collection of illustrations that are photographed frame-by-frame and then played in a quick succession."},"Director":{"Name":"Byron Howard","Bio":"Byron P. Howard is an American animator, character designer, story artist, film director, film producer, and screenwriter. He is best known as the director of the Walt Disney Animation Studios films Bolt, Tangled, Zootopia, and Encanto","Birth":"1968"},"ImagePath":"https://m.media-amazon.com/images/M/MV5BNjE5NzA4ZDctOTJkZi00NzM0LTkwOTYtMDI4MmNkMzIxODhkXkEyXkFqcGdeQXVyNjY1MTg4Mzc@._V1_.jpg","Featured":true}
{"_id":{"$oid":"62461f9da96034e380ce27ca"},"Title":"Coco","Description":"Despite his family's generations-old ban on music, young Miguel dreams of becoming an accomplished musician like his idol Ernesto de la Cruz. Desperate to prove his talent, Miguel finds himself in the stunning and colorful Land of the Dead. After meeting a charming trickster named Héctor, the two new friends embark on an extraordinary journey to unlock the real story behind Miguel's family history.","Genre":3.0,"Director":{"Name":"Adrian Molina","Bio":"Adrian Molina is an American animator, storyboard artist, screenwriter, director, and lyricist. He has been at Pixar since 2007, where he started as a 2D animator on Ratatouille. He later moved on to be a storyboard artist, working on Toy Story 3 and Monsters University.","Birth":"1985"},"ImagePath":"https://m.media-amazon.com/images/M/MV5BYjQ5NjM0Y2YtNjZkNC00ZDhkLWJjMWItN2QyNzFkMDE3ZjAxXkEyXkFqcGdeQXVyODIxMzk5NjA@._V1_.jpg","Featured":true}
{"_id":{"$oid":"6246206ea96034e380ce27cb"},"Title":"Boss Baby","Description":"A new baby's arrival impacts a family, told from the point of view of a delightfully unreliable narrator -- a wildly imaginative 7-year-old named Tim. The most unusual Boss Baby arrives at Tim's home in a taxi, wearing a suit and carrying a briefcase. The instant sibling rivalry must soon be put aside when Tim discovers that Boss Baby is actually a spy on a secret mission, and only he can help thwart a dastardly plot that involves an epic battle between puppies and babies.","Genre":3.0,"Director":{"Name":"Tom McGrath","Bio":"Thomas McGrath is an American voice actor, animator, screenwriter, and film director. He is known for co-directing the DreamWorks animated film Madagascar with Eric Darnell.","Birth":"1964"},"ImagePath":"https://m.media-amazon.com/images/M/MV5BMTg5MzUxNzgxNV5BMl5BanBnXkFtZTgwMTM2NzQ3MjI@._V1_.jpg","Featured":true}
{"_id":{"$oid":"62462172a96034e380ce27cc"},"Title":"Zoot Suit","Description":"Mexican-American gangster Henry Reyna and others in his group are accused of a murder in which they had no part. They are then rounded up by the police because of their race and their choice of clothing. The gang members are thrown into prison and put through a racist trial. As Henry considers his fate, he has a conversation with El Pachuco, a figure from his own conscience who makes him contemplate a choice between his heritage and his home country.","Genre":{"GenreID":4.0,"Name":"Drama","Description":"The drama genre features stories with high stakes and a lot of conflicts."},"Director":{"Name":"Luis Miguel Valdez","Bio":"Luis Miguel Valdez is a Chicano playwright, screenwriter, film director and actor. Regarded as the father of Chicano film and theater, Valdez is best known for his play Zoot Suit, his movie La Bamba, and his creation of El Teatro Campesino.","Birth":"1940"},"ImagePath":"https://m.media-amazon.com/images/M/MV5BMzUxMDk0YTQtOGVjMy00NWRmLTlmYzItMDE1MDFmNmUxMzlhXkEyXkFqcGdeQXVyMTk0NzMzNzc@._V1_.jpg","Featured":false}
